OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/CH-K-Lib/startup/DeviceSupport/MK22F12.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define INT_FTFL                                 INT_FTFE
#define MCM_PLACR_REG(base)                         This_symbol_has_been_deprecated
#define MCM_PLACR                                   This_symbol_has_been_deprecated
#define MCM_FADR                                 This_symbol_has_been_deprecated
#define MCM_FATR                                 This_symbol_has_been_deprecated
#define MCM_FDR                                  This_symbol_has_been_deprecated
#define MCM_FADR_ADDRESS_MASK                    This_symbol_has_been_deprecated
#define MCM_FADR_ADDRESS_SHIFT                   This_symbol_has_been_deprecated
#define MCM_FADR_ADDRESS(x)                      This_symbol_has_been_deprecated
#define MCM_FATR_BEDA_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEDA_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BEMD_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEMD_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BESZ_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BESZ_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BESZ(x)                         This_symbol_has_been_deprecated
#define MCM_FATR_BEWT_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEWT_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BEMN_MASK                       This_symbol_has_been_deprecated
#define MCM_FATR_BEMN_SHIFT                      This_symbol_has_been_deprecated
#define MCM_FATR_BEMN(x)                         This_symbol_has_been_deprecated
#define MCM_FATR_BEOVR_MASK                      This_symbol_has_been_deprecated
#define MCM_FATR_BEOVR_SHIFT                     This_symbol_has_been_deprecated
#define MCM_FDR_DATA_MASK                        This_symbol_has_been_deprecated
#define MCM_FDR_DATA_SHIFT                       This_symbol_has_been_deprecated
#define MCM_FDR_DATA(x)                          This_symbol_has_been_deprecated
#define PORTA_DFER                               This_symbol_has_been_deprecated
#define PORTA_DFCR                               This_symbol_has_been_deprecated
#define PORTA_DFWR                               This_symbol_has_been_deprecated
#define PORTB_DFER                               This_symbol_has_been_deprecated
#define PORTB_DFCR                               This_symbol_has_been_deprecated
#define PORTB_DFWR                               This_symbol_has_been_deprecated
#define PORTC_DFER                               This_symbol_has_been_deprecated
#define PORTC_DFCR                               This_symbol_has_been_deprecated
#define PORTC_DFWR                               This_symbol_has_been_deprecated
#define PORTE_DFER                               This_symbol_has_been_deprecated
#define PORTE_DFCR                               This_symbol_has_been_deprecated
#define PORTE_DFWR                               This_symbol_has_been_deprecated
#define SIM_SCGC5_LPTIMER_MASK                   SIM_SCGC5_LPTMR_MASK
#define SIM_SCGC5_LPTIMER_SHIFT                  SIM_SCGC5_LPTMR_SHIFT
#define SIM_SCGC6_FTFL_MASK                      SIM_SCGC6_FTF_MASK
#define SIM_SCGC6_FTFL_SHIFT                     SIM_SCGC6_FTF_SHIFT
#define USBDCD_TIMER2                            USBDCD_TIMER2_BC11
#define USBDCD_TIMER2_CHECK_DM_MASK              USBDCD_TIMER2_BC11_CHECK_DM_MASK
#define USBDCD_TIMER2_CHECK_DM_SHIFT             USBDCD_TIMER2_BC11_CHECK_DM_SHIFT
#define USBDCD_TIMER2_CHECK_DM(x)                USBDCD_TIMER2_BC11_CHECK_DM
#define USBDCD_TIMER2_TVDPSRC_CON_MASK           USBDCD_TIMER2_BC11_TVDPSRC_CON_MASK
#define USBDCD_TIMER2_TVDPSRC_CON_SHIFT          USBDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT
#define USBDCD_TIMER2_TVDPSRC_CON(x)             USBDCD_TIMER2_BC11_TVDPSRC_CON(x)
#define UART_IE7816_ADTE_MASK                    This_symbol_has_been_deprecated
#define UART_IE7816_ADTE_SHIFT                   This_symbol_has_been_deprecated
#define UART_IS7816_ADT_MASK                     This_symbol_has_been_deprecated
#define UART_IS7816_ADT_SHIFT                    This_symbol_has_been_deprecated
#define UART_WP7816_WTX_MASK                     This_symbol_has_been_deprecated
#define UART_WP7816_WTX_SHIFT                    This_symbol_has_been_deprecated
#define UART_WP7816_WTX(x)                       This_symbol_has_been_deprecated
#define UART_C6_CP_MASK                          This_symbol_has_been_deprecated
#define UART_C6_CP_SHIFT                         This_symbol_has_been_deprecated
#define UART_C6_CE_MASK                          This_symbol_has_been_deprecated
#define UART_C6_CE_SHIFT                         This_symbol_has_been_deprecated
#define UART_C6_TX709_MASK                       This_symbol_has_been_deprecated
#define UART_C6_TX709_SHIFT                      This_symbol_has_been_deprecated
#define UART_C6_EN709_MASK                       This_symbol_has_been_deprecated
#define UART_C6_EN709_SHIFT                      This_symbol_has_been_deprecated
#define UART_PCTH_PCTH_MASK                      This_symbol_has_been_deprecated
#define UART_PCTH_PCTH_SHIFT                     This_symbol_has_been_deprecated
#define UART_PCTH_PCTH(x)                        This_symbol_has_been_deprecated
#define UART_PCTL_PCTL_MASK                      This_symbol_has_been_deprecated
#define UART_PCTL_PCTL_SHIFT                     This_symbol_has_been_deprecated
#define UART_PCTL_PCTL(x)                        This_symbol_has_been_deprecated
#define UART_B1T_B1T_MASK                        This_symbol_has_been_deprecated
#define UART_B1T_B1T_SHIFT                       This_symbol_has_been_deprecated
#define UART_B1T_B1T(x)                          This_symbol_has_been_deprecated
#define UART_SDTH_SDTH_MASK                      This_symbol_has_been_deprecated
#define UART_SDTH_SDTH_SHIFT                     This_symbol_has_been_deprecated
#define UART_SDTH_SDTH(x)                        This_symbol_has_been_deprecated
#define UART_SDTL_SDTL_MASK                      This_symbol_has_been_deprecated
#define UART_SDTL_SDTL_SHIFT                     This_symbol_has_been_deprecated
#define UART_SDTL_SDTL(x)                        This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE_MASK                   This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE_SHIFT                  This_symbol_has_been_deprecated
#define UART_PRE_PREAMBLE(x)                     This_symbol_has_been_deprecated
#define UART_TPL_TPL_MASK                        This_symbol_has_been_deprecated
#define UART_TPL_TPL_SHIFT                       This_symbol_has_been_deprecated
#define UART_TPL_TPL(x)                          This_symbol_has_been_deprecated
#define UART_IE_TXFIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_TXFIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_PSIE_MASK                        This_symbol_has_been_deprecated
#define UART_IE_PSIE_SHIFT                       This_symbol_has_been_deprecated
#define UART_IE_PCTEIE_MASK                      This_symbol_has_been_deprecated
#define UART_IE_PCTEIE_SHIFT                     This_symbol_has_been_deprecated
#define UART_IE_PTXIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_PTXIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_PRXIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_PRXIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_ISDIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_ISDIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_IE_WBEIE_MASK                       This_symbol_has_been_deprecated
#define UART_IE_WBEIE_SHIFT                      This_symbol_has_been_deprecated
#define UART_WB_WBASE_MASK                       This_symbol_has_been_deprecated
#define UART_WB_WBASE_SHIFT                      This_symbol_has_been_deprecated
#define UART_WB_WBASE(x)                         This_symbol_has_been_deprecated
#define UART_S3_TXFF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_TXFF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PSF_MASK                         This_symbol_has_been_deprecated
#define UART_S3_PSF_SHIFT                        This_symbol_has_been_deprecated
#define UART_S3_PCTEF_MASK                       This_symbol_has_been_deprecated
#define UART_S3_PCTEF_SHIFT                      This_symbol_has_been_deprecated
#define UART_S3_PTXF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_PTXF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PRXF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_PRXF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_ISD_MASK                         This_symbol_has_been_deprecated
#define UART_S3_ISD_SHIFT                        This_symbol_has_been_deprecated
#define UART_S3_WBEF_MASK                        This_symbol_has_been_deprecated
#define UART_S3_WBEF_SHIFT                       This_symbol_has_been_deprecated
#define UART_S3_PEF_MASK                         This_symbol_has_been_deprecated
#define UART_S3_PEF_SHIFT                        This_symbol_has_been_deprecated
#define UART_S4_FE_MASK                          This_symbol_has_been_deprecated
#define UART_S4_FE_SHIFT                         This_symbol_has_been_deprecated
#define UART_S4_ILCV_MASK                        This_symbol_has_been_deprecated
#define UART_S4_ILCV_SHIFT                       This_symbol_has_been_deprecated
#define UART_S4_CDET_MASK                        This_symbol_has_been_deprecated
#define UART_S4_CDET_SHIFT                       This_symbol_has_been_deprecated
#define UART_S4_CDET(x)                          This_symbol_has_been_deprecated
#define UART_S4_INITF_MASK                       This_symbol_has_been_deprecated
#define UART_S4_INITF_SHIFT                      This_symbol_has_been_deprecated
#define UART_RPL_RPL_MASK                        This_symbol_has_been_deprecated
#define UART_RPL_RPL_SHIFT                       This_symbol_has_been_deprecated
#define UART_RPL_RPL(x)                          This_symbol_has_been_deprecated
#define UART_RPREL_RPREL_MASK                    This_symbol_has_been_deprecated
#define UART_RPREL_RPREL_SHIFT                   This_symbol_has_been_deprecated
#define UART_RPREL_RPREL(x)                      This_symbol_has_been_deprecated
#define UART_CPW_CPW_MASK                        This_symbol_has_been_deprecated
#define UART_CPW_CPW_SHIFT                       This_symbol_has_been_deprecated
#define UART_CPW_CPW(x)                          This_symbol_has_been_deprecated
#define UART_RIDT_RIDT_MASK                      This_symbol_has_been_deprecated
#define UART_RIDT_RIDT_SHIFT                     This_symbol_has_been_deprecated
#define UART_RIDT_RIDT(x)                        This_symbol_has_been_deprecated
#define UART_TIDT_TIDT_MASK                      This_symbol_has_been_deprecated
#define UART_TIDT_TIDT_SHIFT                     This_symbol_has_been_deprecated
#define UART_TIDT_TIDT(x)                        This_symbol_has_been_deprecated
#define UART_AP7816A_T0_ADTI_H_MASK              This_symbol_has_been_deprecated
#define UART_AP7816A_T0_ADTI_H_SHIFT             This_symbol_has_been_deprecated
#define UART_AP7816A_T0_ADTI_H(x)                This_symbol_has_been_deprecated
#define UART_AP7816B_T0_ADTI_L_MASK              This_symbol_has_been_deprecated
#define UART_AP7816B_T0_ADTI_L_SHIFT             This_symbol_has_been_deprecated
#define UART_AP7816B_T0_ADTI_L(x)                This_symbol_has_been_deprecated
#define UART_WP7816A_T0_WI_H_MASK                This_symbol_has_been_deprecated
#define UART_WP7816A_T0_WI_H_SHIFT               This_symbol_has_been_deprecated
#define UART_WP7816A_T0_WI_H(x)                  This_symbol_has_been_deprecated
#define UART_WP7816B_T0_WI_L_MASK                This_symbol_has_been_deprecated
#define UART_WP7816B_T0_WI_L_SHIFT               This_symbol_has_been_deprecated
#define UART_WP7816B_T0_WI_L(x)                  This_symbol_has_been_deprecated
#define UART_WP7816A_T1_BWI_H_MASK               This_symbol_has_been_deprecated
#define UART_WP7816A_T1_BWI_H_SHIFT              This_symbol_has_been_deprecated
#define UART_WP7816A_T1_BWI_H(x)                 This_symbol_has_been_deprecated
#define UART_WP7816B_T1_BWI_L_MASK               This_symbol_has_been_deprecated
#define UART_WP7816B_T1_BWI_L_SHIFT              This_symbol_has_been_deprecated
#define UART_WP7816B_T1_BWI_L(x)                 This_symbol_has_been_deprecated
#define UART_WGP7816_T1_BGI_MASK                 This_symbol_has_been_deprecated
#define UART_WGP7816_T1_BGI_SHIFT                This_symbol_has_been_deprecated
#define UART_WGP7816_T1_BGI(x)                   This_symbol_has_been_deprecated
#define UART_WGP7816_T1_CWI1_MASK                This_symbol_has_been_deprecated
#define UART_WGP7816_T1_CWI1_SHIFT               This_symbol_has_been_deprecated
#define UART_WGP7816_T1_CWI1(x)                  This_symbol_has_been_deprecated
#define UART_WP7816C_T1_CWI2_MASK                This_symbol_has_been_deprecated
#define UART_WP7816C_T1_CWI2_SHIFT               This_symbol_has_been_deprecated
#define UART_WP7816C_T1_CWI2(x)                  This_symbol_has_been_deprecated
#define UART0_WP7816                             This_symbol_has_been_deprecated
#define UART0_C6                                 This_symbol_has_been_deprecated
#define UART0_PCTH                               This_symbol_has_been_deprecated
#define UART0_PCTL                               This_symbol_has_been_deprecated
#define UART0_B1T                                This_symbol_has_been_deprecated
#define UART0_SDTH                               This_symbol_has_been_deprecated
#define UART0_SDTL                               This_symbol_has_been_deprecated
#define UART0_PRE                                This_symbol_has_been_deprecated
#define UART0_TPL                                This_symbol_has_been_deprecated
#define UART0_IE                                 This_symbol_has_been_deprecated
#define UART0_WB                                 This_symbol_has_been_deprecated
#define UART0_S3                                 This_symbol_has_been_deprecated
#define UART0_S4                                 This_symbol_has_been_deprecated
#define UART0_RPL                                This_symbol_has_been_deprecated
#define UART0_RPREL                              This_symbol_has_been_deprecated
#define UART0_CPW                                This_symbol_has_been_deprecated
#define UART0_RIDT                               This_symbol_has_been_deprecated
#define UART0_TIDT                               This_symbol_has_been_deprecated
#define UART0_AP7816A_T0                         This_symbol_has_been_deprecated
#define UART0_AP7816B_T0                         This_symbol_has_been_deprecated
#define UART0_WP7816A_T0                         This_symbol_has_been_deprecated
#define UART0_WP7816A_T1                         This_symbol_has_been_deprecated
#define UART0_WP7816B_T0                         This_symbol_has_been_deprecated
#define UART0_WP7816B_T1                         This_symbol_has_been_deprecated
#define UART0_WGP7816_T1                         This_symbol_has_been_deprecated
#define UART0_WP7816C_T1                         This_symbol_has_been_deprecated
#define ADC_BASES                    ADC_BASE_PTRS
#define AXBS_BASES                   AXBS_BASE_PTRS
#define CAN_BASES                    CAN_BASE_PTRS
#define CAU_LDR_CAA_CAA_MASK         CAU_LDR_CAA_ACC_MASK
#define CAU_LDR_CAA_CAA_SHIFT        CAU_LDR_CAA_ACC_SHIFT
#define CAU_LDR_CAA_CAA(x)           CAU_LDR_CAA_ACC(x)
#define CAU_STR_CAA_CAA_MASK         CAU_STR_CAA_ACC_MASK
#define CAU_STR_CAA_CAA_SHIFT        CAU_STR_CAA_ACC_SHIFT
#define CAU_STR_CAA_CAA(x)           CAU_STR_CAA_ACC(x)
#define CAU_ADR_CAA_CAA_MASK         CAU_ADR_CAA_ACC_MASK
#define CAU_ADR_CAA_CAA_SHIFT        CAU_ADR_CAA_ACC_SHIFT
#define CAU_ADR_CAA_CAA(x)           CAU_ADR_CAA_ACC(x)
#define CAU_RADR_CAA_CAA_MASK        CAU_RADR_CAA_ACC_MASK
#define CAU_RADR_CAA_CAA_SHIFT       CAU_RADR_CAA_ACC_SHIFT
#define CAU_RADR_CAA_CAA(x)          CAU_RADR_CAA_ACC(x)
#define CAU_XOR_CAA_CAA_MASK         CAU_XOR_CAA_ACC_MASK
#define CAU_XOR_CAA_CAA_SHIFT        CAU_XOR_CAA_ACC_SHIFT
#define CAU_XOR_CAA_CAA(x)           CAU_XOR_CAA_ACC(x)
#define CAU_ROTL_CAA_CAA_MASK        CAU_ROTL_CAA_ACC_MASK
#define CAU_ROTL_CAA_CAA_SHIFT       CAU_ROTL_CAA_ACC_SHIFT
#define CAU_ROTL_CAA_CAA(x)          CAU_ROTL_CAA_ACC(x)
#define CAU_AESC_CAA_CAA_MASK        CAU_AESC_CAA_ACC_MASK
#define CAU_AESC_CAA_CAA_SHIFT       CAU_AESC_CAA_ACC_SHIFT
#define CAU_AESC_CAA_CAA(x)          CAU_AESC_CAA_ACC(x)
#define CAU_AESIC_CAA_CAA_MASK       CAU_AESIC_CAA_ACC_MASK
#define CAU_AESIC_CAA_CAA_SHIFT      CAU_AESIC_CAA_ACC_SHIFT
#define CAU_AESIC_CAA_CAA(x)         CAU_AESIC_CAA_ACC(x)
#define CAU_BASES                    CAU_BASE_PTRS
#define CMP_BASES                    CMP_BASE_PTRS
#define CMT_BASES                    CMT_BASE_PTRS
#define CRC_BASES                    CRC_BASE_PTRS
#define DAC_BASES                    DAC_BASE_PTRS
#define DMA_BASES                    DMA_BASE_PTRS
#define DMAMUX_BASES                 DMAMUX_BASE_PTRS
#define EWM_BASES                    EWM_BASE_PTRS
#define FB_BASES                     FB_BASE_PTRS
#define FMC_BASES                    FMC_BASE_PTRS
#define FTFE_BASES                   FTFE_BASE_PTRS
#define FTM_BASES                    FTM_BASE_PTRS
#define GPIO_BASES                   GPIO_BASE_PTRS
#define I2C_BASES                    I2C_BASE_PTRS
#define I2S_BASES                    I2S_BASE_PTRS
#define LLWU_BASES                   LLWU_BASE_PTRS
#define LPTMR_BASES                  LPTMR_BASE_PTRS
#define MCG_BASES                    MCG_BASE_PTRS
#define MCM_ISR_FIOC_MASK            MCM_ISCR_FIOC_MASK
#define MCM_ISR_FIOC_SHIFT           MCM_ISCR_FIOC_SHIFT
#define MCM_ISR_FDZC_MASK            MCM_ISCR_FDZC_MASK
#define MCM_ISR_FDZC_SHIFT           MCM_ISCR_FDZC_SHIFT
#define MCM_ISR_FOFC_MASK            MCM_ISCR_FOFC_MASK
#define MCM_ISR_FOFC_SHIFT           MCM_ISCR_FOFC_SHIFT
#define MCM_ISR_FUFC_MASK            MCM_ISCR_FUFC_MASK
#define MCM_ISR_FUFC_SHIFT           MCM_ISCR_FUFC_SHIFT
#define MCM_ISR_FIXC_MASK            MCM_ISCR_FIXC_MASK
#define MCM_ISR_FIXC_SHIFT           MCM_ISCR_FIXC_SHIFT
#define MCM_ISR_FIDC_MASK            MCM_ISCR_FIDC_MASK
#define MCM_ISR_FIDC_SHIFT           MCM_ISCR_FIDC_SHIFT
#define MCM_ISR_FIOCE_MASK           MCM_ISCR_FIOCE_MASK
#define MCM_ISR_FIOCE_SHIFT          MCM_ISCR_FIOCE_SHIFT
#define MCM_ISR_FDZCE_MASK           MCM_ISCR_FDZCE_MASK
#define MCM_ISR_FDZCE_SHIFT          MCM_ISCR_FDZCE_SHIFT
#define MCM_ISR_FOFCE_MASK           MCM_ISCR_FOFCE_MASK
#define MCM_ISR_FOFCE_SHIFT          MCM_ISCR_FOFCE_SHIFT
#define MCM_ISR_FUFCE_MASK           MCM_ISCR_FUFCE_MASK
#define MCM_ISR_FUFCE_SHIFT          MCM_ISCR_FUFCE_SHIFT
#define MCM_ISR_FIXCE_MASK           MCM_ISCR_FIXCE_MASK
#define MCM_ISR_FIXCE_SHIFT          MCM_ISCR_FIXCE_SHIFT
#define MCM_ISR_FIDCE_MASK           MCM_ISCR_FIDCE_MASK
#define MCM_ISR_FIDCE_SHIFT          MCM_ISCR_FIDCE_SHIFT
#define MCM_BASES                    MCM_BASE_PTRS
#define MPU_BASES                    MPU_BASE_PTRS
#define NV_BASES                     NV_BASE_PTRS
#define OSC_BASES                    OSC_BASE_PTRS
#define PDB_BASES                    PDB_BASE_PTRS
#define PIT_BASES                    PIT_BASE_PTRS
#define PMC_BASES                    PMC_BASE_PTRS
#define PORT_BASES                   PORT_BASE_PTRS
#define RCM_BASES                    RCM_BASE_PTRS
#define RFSYS_BASES                  RFSYS_BASE_PTRS
#define RFVBAT_BASES                 RFVBAT_BASE_PTRS
#define RNG_BASES                    RNG_BASE_PTRS
#define RTC_BASES                    RTC_BASE_PTRS
#define SDHS_BASES                   SDHC_BASE_PTRS
#define SIM_BASES                    SIM_BASE_PTRS
#define SMC_BASES                    SMC_BASE_PTRS
#define SPI_BASES                    SPI_BASE_PTRS
#define UART_WP7816_T_TYPE0_WI_MASK  UART_WP7816T0_WI_MASK
#define UART_WP7816_T_TYPE0_WI_SHIFT UART_WP7816T0_WI_SHIFT
#define UART_WP7816_T_TYPE0_WI(x)    UART_WP7816T0_WI(x)
#define UART_WP7816_T_TYPE1_BWI_MASK UART_WP7816T1_BWI_MASK
#define UART_WP7816_T_TYPE1_BWI_SHIFT UART_WP7816T1_BWI_SHIFT
#define UART_WP7816_T_TYPE1_BWI(x)   UART_WP7816T1_BWI(x)
#define UART_WP7816_T_TYPE1_CWI_MASK UART_WP7816T1_CWI_MASK
#define UART_WP7816_T_TYPE1_CWI_SHIFT UART_WP7816T1_CWI_SHIFT
#define UART_WP7816_T_TYPE1_CWI(x)   UART_WP7816T1_CWI(x)
#define UART_BASES                   UART_BASE_PTRS
#define USB_BASES                    USB_BASE_PTRS
#define USBDCD_BASES                 USBDCD_BASE_PTRS
#define VREF_BASES                   VREF_BASE_PTRS
#define WDOG_BASES                   WDOG_BASE_PTRS
#define Watchdog_IRQn                WDOG_EWM_IRQn
#define Watchdog_IRQHandler          WDOG_EWM_IRQHandler
#define LPTimer_IRQn                 LPTMR0_IRQn
#define LPTimer_IRQHandler           LPTMR0_IRQHandler
#define LLW_IRQn                     LLWU_IRQn
#define LLW_IRQHandler               LLWU_IRQHandler

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MK22F12_H_) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MK22F12_H_) */

/* MK22F12.h, eof. */
